; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_8)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 - link
    angle0 angle30 angle60 angle90 angle120 angle150 angle180 angle210 angle240 angle270 angle300 angle330 - angle)
(:init
    (AngleOrd angle0 angle30)
    (AngleOrd angle30 angle60)
    (AngleOrd angle60 angle90)
    (AngleOrd angle90 angle120)
    (AngleOrd angle120 angle150)
    (AngleOrd angle150 angle180)
    (AngleOrd angle180 angle210)
    (AngleOrd angle210 angle240)
    (AngleOrd angle240 angle270)
    (AngleOrd angle270 angle300)
    (AngleOrd angle300 angle330)
    (AngleOrd angle330 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)
    (IsChildOf link4 link3)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)
    (Affected link4 link1)
    (Affected link4 link2)
    (Affected link4 link3)

    (HasAngle angle0 link1)
    (HasAngle angle240 link2)
    (HasAngle angle30 link3)
    (HasAngle angle270 link4)
)
(:goal
(and
    (HasAngle angle210 link1)
    (HasAngle angle30 link2)
    (HasAngle angle240 link3)
    (HasAngle angle180 link4)
    )
)
)

; plan
1. (decrease_angle link1 angle0 angle330)
   deleted: (hasangle angle0 link1) (hasangle angle240 link2) (hasangle angle30 link3) (hasangle angle270 link4)
   added: (hasangle angle330 link1) (hasangle angle210 link2) (hasangle angle0 link3) (hasangle angle240 link4)
   goals met: 0 of 4
2. (decrease_angle link1 angle330 angle300)
   deleted: (hasangle angle330 link1) (hasangle angle210 link2) (hasangle angle0 link3) (hasangle angle240 link4)
   added: (hasangle angle300 link1) (hasangle angle180 link2) (hasangle angle330 link3) (hasangle angle210 link4)
   goals met: 0 of 4
3. (decrease_angle link1 angle300 angle270)
   deleted: (hasangle angle300 link1) (hasangle angle180 link2) (hasangle angle330 link3) (hasangle angle210 link4)
   added: (hasangle angle270 link1) (hasangle angle150 link2) (hasangle angle300 link3) (hasangle angle180 link4)
   goals met: 1 of 4
4. (decrease_angle link1 angle270 angle240)
   deleted: (hasangle angle270 link1) (hasangle angle150 link2) (hasangle angle300 link3) (hasangle angle180 link4)
   added: (hasangle angle240 link1) (hasangle angle120 link2) (hasangle angle270 link3) (hasangle angle150 link4)
   goals met: 0 of 4
5. (decrease_angle link1 angle240 angle210)
   deleted: (hasangle angle240 link1) (hasangle angle120 link2) (hasangle angle270 link3) (hasangle angle150 link4)
   added: (hasangle angle210 link1) (hasangle angle90 link2) (hasangle angle240 link3) (hasangle angle120 link4)
   goals met: 2 of 4
6. (decrease_angle link2 angle90 angle60)
   deleted: (hasangle angle90 link2) (hasangle angle240 link3) (hasangle angle120 link4)
   added: (hasangle angle60 link2) (hasangle angle210 link3) (hasangle angle90 link4)
   goals met: 1 of 4
7. (decrease_angle link2 angle60 angle30)
   deleted: (hasangle angle60 link2) (hasangle angle210 link3) (hasangle angle90 link4)
   added: (hasangle angle30 link2) (hasangle angle180 link3) (hasangle angle60 link4)
   goals met: 2 of 4
8. (increase_angle link3 angle180 angle210)
   deleted: (hasangle angle180 link3) (hasangle angle60 link4)
   added: (hasangle angle210 link3) (hasangle angle90 link4)
   goals met: 2 of 4
9. (increase_angle link3 angle210 angle240)
   deleted: (hasangle angle210 link3) (hasangle angle90 link4)
   added: (hasangle angle240 link3) (hasangle angle120 link4)
   goals met: 3 of 4
10. (increase_angle link4 angle120 angle150)
   deleted: (hasangle angle120 link4)
   added: (hasangle angle150 link4)
   goals met: 3 of 4
11. (increase_angle link4 angle150 angle180)
   deleted: (hasangle angle150 link4)
   added: (hasangle angle180 link4)
   goals met: 4 of 4
